<html>
     <head>
         <title>Базовая страница</title>
     </head>
     <body>
         <h1>Стихи про осень: А. С. Пушкин</h1>
     </body>
     <p>Унылая пора! Очей очарованье!</p><br>
     <p>Приятна мне твоя прощальная краса —</p><br>
     <p>Люблю я пышное природы увяданье,</p><br>
     <p>В багрец и в золото одетые леса,</p><br>
     <p>В их сенях ветра шум и свежее дыханье,</p><br>
     <p>И мглой волнистою покрыты небеса,</p><br>
     <p>И редкий солнца луч, и первые морозы,</p><br>
     <p>И отдаленные седой зимы угрозы.</p>
</html>