<?php
    $name = 'Математические вычисления';
    $index = 'index.php';
    $pages1 = '1.php';
    $pages2 = '2.php';
    $pages3 = '3.php';
    $a = 25;
    $b = 5;
    $exp = 2;
?>
<!DOCTYPE html>
<html>
<head>
    <title><?= $name ?></title>
</head>
<body>
    <? echo "<h2> $name </h2>";?>
<?php
    $f = 'Сумма чисел ' . $a . ' и ' . $b . ' = ';
    $c = $a + $b;
    $f1 = 'Разность чисел ' . $a . ' и ' . $b . ' = ';
    $d = $a - $b;
    $f2 = 'Произведение чисел ' . $a . ' и ' . $b . ' = ';
    $n = $a * $b;
    $f3 = 'Частное чисел ' . $a . ' и ' . $b . ' = ';
    $k = $a / $b;
    $f4 = $exp . ' Степень числа ' . $a . ' = ';
    $p = $a**$exp;
    $f5 = $exp . ' Степень числа ' . $b . ' = ';
    $s = $b**$exp;
?>
<h3><?= $f . $c ?> </h3>
<h3><?= $f1 . $d ?> </h3>
<h3><?= $f2 . $n ?> </h3>
<h3><?= $f3 . $k ?> </h3>
<h3><?= $f4 . $p ?> </h3>
<h3><?= $f5 . $s ?> </h3>
<ul>
    <li><a href="<?= $index ?>">Перейти на главную страницу</a><br></li>
    <li><a href="<?= $pages1 ?>">Перейти на 1-ю страницу</a><br></li>
    <li><a href="<?= $pages2 ?>">Перейти на 2-ю страницу</a></li>
    <li><a href="<?= $pages3 ?>">Перейти на 3-ю страницу</a></li>
</ul>
</body>
</html>
